{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 3,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.3",
      "pad_fill_mode" : 0,
      "pad_b" : 3,
      "pad_l" : 3,
      "top" : "input.5",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "input.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 3,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "x_1",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.7",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.7",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.7",
      "pad_t" : 1,
      "stride_y" : 2,
      "bottom" : "input.5",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.11",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.13",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "input.11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.7",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.1",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "name" : "out.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.1,input.7",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.17",
      "top" : "input.17",
      "type" : "elementwise",
      "name" : "input.17",
      "beta" : 0
    },
    {
      "bottom" : "input.17",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.19",
      "top" : "input.19",
      "type" : "activation",
      "name" : "input.19"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.25",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.19",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.3",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "out.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.25",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.3,input.19",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.29",
      "top" : "input.29",
      "type" : "elementwise",
      "name" : "input.29",
      "beta" : 0
    },
    {
      "bottom" : "input.29",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "activation",
      "name" : "input.31"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.35",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.37",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "stride_x" : 2,
      "name" : "input.35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.31",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.5",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.5",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "out.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.37",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "identity.1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "identity.1",
      "blob_weights" : 31,
      "K" : 64,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "identity.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.31",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.5,identity.1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.43",
      "top" : "input.43",
      "type" : "elementwise",
      "name" : "input.43",
      "beta" : 0
    },
    {
      "bottom" : "input.43",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.45",
      "top" : "input.45",
      "type" : "activation",
      "name" : "input.45"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.49",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.51",
      "blob_weights" : 35,
      "K" : 128,
      "blob_biases" : 33,
      "name" : "input.49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.45",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.7",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.7",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "out.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.51",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.7,input.45",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "elementwise",
      "name" : "input.55",
      "beta" : 0
    },
    {
      "bottom" : "input.55",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.57",
      "top" : "input.57",
      "type" : "activation",
      "name" : "input.57"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.61",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.63",
      "blob_weights" : 43,
      "K" : 128,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "input.61",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.57",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.9",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.9",
      "blob_weights" : 47,
      "K" : 256,
      "blob_biases" : 45,
      "name" : "out.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.63",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "identity.3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "identity.3",
      "blob_weights" : 51,
      "K" : 128,
      "blob_biases" : 49,
      "stride_x" : 2,
      "name" : "identity.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.57",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.9,identity.3",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.69",
      "top" : "input.69",
      "type" : "elementwise",
      "name" : "input.69",
      "beta" : 0
    },
    {
      "bottom" : "input.69",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.71",
      "top" : "input.71",
      "type" : "activation",
      "name" : "input.71"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.75",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.77",
      "blob_weights" : 55,
      "K" : 256,
      "blob_biases" : 53,
      "name" : "input.75",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.71",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.11",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.11",
      "blob_weights" : 59,
      "K" : 256,
      "blob_biases" : 57,
      "name" : "out.11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.77",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.11,input.71",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.81",
      "top" : "input.81",
      "type" : "elementwise",
      "name" : "input.81",
      "beta" : 0
    },
    {
      "bottom" : "input.81",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.83",
      "top" : "input.83",
      "type" : "activation",
      "name" : "input.83"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.87",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.89",
      "blob_weights" : 63,
      "K" : 256,
      "blob_biases" : 61,
      "stride_x" : 2,
      "name" : "input.87",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.83",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out.13",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.13",
      "blob_weights" : 67,
      "K" : 256,
      "blob_biases" : 65,
      "name" : "out.13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.89",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "identity",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "identity",
      "blob_weights" : 71,
      "K" : 256,
      "blob_biases" : 69,
      "stride_x" : 2,
      "name" : "identity",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.83",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "out.13,identity",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.95",
      "top" : "input.95",
      "type" : "elementwise",
      "name" : "input.95",
      "beta" : 0
    },
    {
      "bottom" : "input.95",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.97",
      "top" : "input.97",
      "type" : "activation",
      "name" : "input.97"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.101",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.103",
      "blob_weights" : 75,
      "K" : 256,
      "blob_biases" : 73,
      "name" : "input.101",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.97",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "out",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out",
      "blob_weights" : 79,
      "K" : 256,
      "blob_biases" : 77,
      "name" : "out",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.103",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "out,input.97",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.107",
      "top" : "input.107",
      "type" : "elementwise",
      "name" : "input.107",
      "beta" : 0
    },
    {
      "bottom" : "input.107",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.109",
      "top" : "input.109",
      "type" : "activation",
      "name" : "input.109"
    },
    {
      "pad_r" : 0,
      "debug_info" : "x",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 8,
      "is_global" : 1,
      "top" : "x",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "x",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.109",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 8,
      "pad_value" : 0
    },
    {
      "name" : "input",
      "weights" : {

      },
      "dst_w" : 256,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x",
      "debug_info" : "input",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input"
    },
    {
      "has_prelu" : 0,
      "top" : "linear_0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 83,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "input",
      "debug_info" : "linear_0",
      "has_tanh" : 0,
      "blob_biases" : 81,
      "name" : "linear_0",
      "nB" : 256
    }
  ]
}